Revit 2026 API

# MasonryCMUMasonryCMUPatternHeight Property

---

The property labeled "Amount" from the "MasonryCMU" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string MasonryCMUPatternHeight { get; }
```
```vb
Public Shared ReadOnly Property MasonryCMUPatternHeight As String
	Get
```
```cpp
public:
static property String^ MasonryCMUPatternHeight {
	String^ get ();
}
```
```fsharp
static member MasonryCMUPatternHeight : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 2".

#### Reference

MasonryCMU Class

Autodesk.Revit.DB.Visual Namespace